Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Load/cassandra2-cql_workloada_400000_load_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 201060.0
[OVERALL], Throughput(ops/sec), 1989.4558838157764
[TOTAL_GCS_PS_Scavenge], Count, 573.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1415.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7037700188998309
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 573.0
[TOTAL_GC_TIME], Time(ms), 1415.0
[TOTAL_GC_TIME_%], Time(%), 0.7037700188998309
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2245632.0
[CLEANUP], MinLatency(us), 2244608.0
[CLEANUP], MaxLatency(us), 2246655.0
[CLEANUP], 95thPercentileLatency(us), 2246655.0
[CLEANUP], 99thPercentileLatency(us), 2246655.0
[INSERT], Operations, 400000.0
[INSERT], AverageLatency(us), 489.5984225
[INSERT], MinLatency(us), 263.0
[INSERT], MaxLatency(us), 123967.0
[INSERT], 95thPercentileLatency(us), 587.0
[INSERT], 99thPercentileLatency(us), 794.0
[INSERT], Return=OK, 400000