Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Load/cassandra2-cql_workloadf_200000_load_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 102580.0
[OVERALL], Throughput(ops/sec), 1839.5691167868981
[TOTAL_GCS_PS_Scavenge], Count, 162.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 522.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5088711249756288
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 162.0
[TOTAL_GC_TIME], Time(ms), 522.0
[TOTAL_GC_TIME_%], Time(%), 0.5088711249756288
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2245632.0
[CLEANUP], MinLatency(us), 2244608.0
[CLEANUP], MaxLatency(us), 2246655.0
[CLEANUP], 95thPercentileLatency(us), 2246655.0
[CLEANUP], 99thPercentileLatency(us), 2246655.0
[INSERT], Operations, 188703.0
[INSERT], AverageLatency(us), 508.2439070920971
[INSERT], MinLatency(us), 267.0
[INSERT], MaxLatency(us), 279807.0
[INSERT], 95thPercentileLatency(us), 629.0
[INSERT], 99thPercentileLatency(us), 932.0
[INSERT], Return=OK, 188703
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1.0
[INSERT-FAILED], AverageLatency(us), 2376704.0
[INSERT-FAILED], MinLatency(us), 2375680.0
[INSERT-FAILED], MaxLatency(us), 2377727.0
[INSERT-FAILED], 95thPercentileLatency(us), 2377727.0
[INSERT-FAILED], 99thPercentileLatency(us), 2377727.0