Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Load/cassandra2-cql_workloadf_600000_load_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 48370.0
[OVERALL], Throughput(ops/sec), 1519.495555096134
[TOTAL_GCS_PS_Scavenge], Count, 23.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 190.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.39280545792846805
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 23.0
[TOTAL_GC_TIME], Time(ms), 190.0
[TOTAL_GC_TIME_%], Time(%), 0.39280545792846805
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2272256.0
[CLEANUP], MinLatency(us), 2271232.0
[CLEANUP], MaxLatency(us), 2273279.0
[CLEANUP], 95thPercentileLatency(us), 2273279.0
[CLEANUP], 99thPercentileLatency(us), 2273279.0
[INSERT], Operations, 73498.0
[INSERT], AverageLatency(us), 548.9503659963536
[INSERT], MinLatency(us), 286.0
[INSERT], MaxLatency(us), 125183.0
[INSERT], 95thPercentileLatency(us), 707.0
[INSERT], 99thPercentileLatency(us), 1346.0
[INSERT], Return=OK, 73498
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1.0
[INSERT-FAILED], AverageLatency(us), 2015744.0
[INSERT-FAILED], MinLatency(us), 2015232.0
[INSERT-FAILED], MaxLatency(us), 2016255.0
[INSERT-FAILED], 95thPercentileLatency(us), 2016255.0
[INSERT-FAILED], 99thPercentileLatency(us), 2016255.0