Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Load/cassandra2-cql_workloadf_800000_load_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 365453.0
[OVERALL], Throughput(ops/sec), 1995.1676412561944
[TOTAL_GCS_PS_Scavenge], Count, 948.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2617.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7160975556364293
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 948.0
[TOTAL_GC_TIME], Time(ms), 2617.0
[TOTAL_GC_TIME_%], Time(%), 0.7160975556364293
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 3261440.0
[CLEANUP], MinLatency(us), 3260416.0
[CLEANUP], MaxLatency(us), 3262463.0
[CLEANUP], 95thPercentileLatency(us), 3262463.0
[CLEANUP], 99thPercentileLatency(us), 3262463.0
[INSERT], Operations, 729140.0
[INSERT], AverageLatency(us), 485.0529445648298
[INSERT], MinLatency(us), 273.0
[INSERT], MaxLatency(us), 1617919.0
[INSERT], 95thPercentileLatency(us), 575.0
[INSERT], 99thPercentileLatency(us), 758.0
[INSERT], Return=OK, 729140
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1.0
[INSERT-FAILED], AverageLatency(us), 4249600.0
[INSERT-FAILED], MinLatency(us), 4247552.0
[INSERT-FAILED], MaxLatency(us), 4251647.0
[INSERT-FAILED], 95thPercentileLatency(us), 4251647.0
[INSERT-FAILED], 99thPercentileLatency(us), 4251647.0