Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test/Output/Load/mongodb_workloadf_400000_load_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 67082.0
[OVERALL], Throughput(ops/sec), 5962.851435556483
[TOTAL_GCS_PS_Scavenge], Count, 123.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 211.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3145404132256045
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 123.0
[TOTAL_GC_TIME], Time(ms), 211.0
[TOTAL_GC_TIME_%], Time(%), 0.3145404132256045
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 3407.0
[CLEANUP], MinLatency(us), 3406.0
[CLEANUP], MaxLatency(us), 3407.0
[CLEANUP], 95thPercentileLatency(us), 3407.0
[CLEANUP], 99thPercentileLatency(us), 3407.0
[INSERT], Operations, 400000.0
[INSERT], AverageLatency(us), 163.2445375
[INSERT], MinLatency(us), 103.0
[INSERT], MaxLatency(us), 1987583.0
[INSERT], 95thPercentileLatency(us), 223.0
[INSERT], 99thPercentileLatency(us), 370.0
[INSERT], Return=OK, 400000